//Напишіть умову if, щоб перевірити, чи age знаходиться між 14 та 90 включно. -->
//“Включно” означає, що age може досягати країв 14 або 90. -->
let age=20;
if (age >= 14 && age <= 90); // якщо вік більше= I менше= 90

// Напишіть умову if, щоб перевірити, чи значення age НЕ знаходиться між 14 та 90 включно. -->
// Створіть два варіанти: перший з оператором НЕ !, другий — без нього. -->

if (age <=14 && age >=90); // вік менше 14 І вік більше 90. Має виконуватись обидві умови одночасно
if (age < 14 || age > 90); // якщо вік менше 14 АБО менше 90. Якщо хоча б одне значення працює

let age=21;
if ((age >=18 || age<= 60) && age >=25"); // якщо вік більше/дорівнює 18 АБО вік менше= 60 І вік більше= 25)
if ((true || false) && age >=25)
if (true && age >=25) //І 
if (true && false) // немає 
//result will be false 
