// якщо перший операнд правдивий,
// І повертає другий операнд:
alert(1 && 0); // 0
alert(1 && 5); // 5

// якщо перший операнд хибний,
// І повертає саме його. Другий операнд ігнорується
alert(null && 5); // null
alert(0 && "неважливо"); // 0

let hour = 9;

if (hour < 10 || hour > 18) {
  alert("Офіс зачинений.");
} // || означає АБО. Якщо один із варіантів правильний - виводиться повідомлення

let firstName = "";
let lastName = "";
let nickName = "СуперКодер";
alert(firstName || lastName || nickName || "Анонім"); // СуперКодер
//Знаходить ПЕРШЕ правдиве значення, всі подальші не опрацьовуються

alert(true && true); // true
alert(false && true); // false
alert(true && false); // false
alert(false && false); // false Два амперсанди вимагають щоб УСІ значення були правдиві

alert(1 && 2 && null && 3); // виводить перше НЕПРАВИЛЬНЕ значення або останнє загальне

//Отже, код a && b || c && d по суті є таким самим, як код з виразами && у дужках: (a && b) || (c && d).
